Repository: RangiraDave/AgriConnect
Catalog: locale/*/LC_MESSAGES/django.po
Languages: rw

source: English
rw: Icyongereza

source: Kinyarwanda
rw: Ikinyarwanda

source: Hello {user_name}! I'm AgriConnect Assistant. I can help you with information about {product_name}. What would you like to know?
rw: Muraho {user_name}! Ngewe mpfasha abagana AgriConnect. Nagufasha kumenya ibyerecyeye {product_name}. Ni iki ukeneye kumenya kuri iki gicuruzwa?

source: I'm sorry, I couldn't find that product. How else can I help you?
rw: Mwihangane icyo gicuruzwa ntikibashije kuboneka. Tubafashe iki kindi?

source: Hello {user_name}! I'm AgriConnect Assistant. How can I help you today?
rw: Muraho {user_name}! Mpfasha abagana AgriConnect. Tubafashe iki?

source: Thank you for using AgriConnect! If you have any more questions, feel free to ask. Have a great day!
rw: Murakoze gukoresha AgriConnect! Mufite ikindi kibazo mwatubaza.Mugire umunsi mwiza.

source: Hello {user_name}, I'm AgriConnect Assistant. I can help you with information about {product_name}. What would you like to know?
rw: Muraho {user_name}! Ngewe mpfasha abagana AgriConnect. Nagufasha kumenya ibyerecyeye {product_name}. Ni iki ukeneye kumenya kuri iki gicuruzwa?

source: Hello! I'm AgriConnect Assistant. How can I help you today?
rw: Muraho! Mpfasha abagana AgriConnect. Tubafashe iki?

source: No detailed description available for this product.
rw: Ntabusobanura kugicuruzwa bubashije kuboneka.

source: This product is available in: {location}
rw: Ikigicuruzwa mwagisanga aha hakurikira: {location}

source: Location information not available
rw: Ntamakuru yerecyeye aho giherereye abashije kuboneka

source: The price is {price} per {unit} of {product_name}.
rw: Igiciro cya {product_name} ni {price} buri {unit}.

source: There are {quantity} {unit} of {product_name} available.
rw: Hari {unit} {quantity} bya {product_name}.

source: You can contact the seller at {phone}. The seller is a {role}.
rw: Mwahamagara uyu {role} kuri {phone}

source: Contact information not available
rw: Nta nimero za telephone zibashije kuboneka

source: This product has an average rating of {rating:.1f} stars from {count} reviews.
rw: Ikigicuruzwa gifite amanota {rating:.1f} kuva kubantu {count}.

source: This product hasn't received any ratings yet.
rw: Ikigicuruzwa ntamanota cyari cyagira.

source: Here is an image of the product: {url}
rw: Dore ifoto y'igicuruzwa: {url}

source: No image is available for this product.
rw: Ntafoto ibashije kuboneka y'ikigicuruzwa.

source: Here is a video of the product: {url}
rw: Ngiyi videwo y'ikigicuruzwa: {url}

source: No video is available for this product.
rw: Nta videwo y'ikigicuruzwa ibashije kuboneka.

source: This product is sold by {username}, who is a {role}. You can contact them at {phone}.
rw: Ikigicuruzwa kirimo kugurishwa na {username}, akaba ari {role}.wamuhamagara kuri {phone}.

source: I can help you with information about: - Product details and description - Price and availability - Location and contact information - Ratings and reviews - Images and videos - Seller information What would you like to know?
rw: Dore ibyo nabasha kugufasha kumenya kuri iki gicuruzwa: - Amakuru arambuye - Igiciro wakibonaho - Aho wagisanga - Amanota gifite k'isoko - Ifoto cyangwa videwo yacyo - Ndetse n'andimakuru yerecyeye nyiracyo. Ni icyihe muri ibyo mucyeneye kumenya?

source: Please clarify your question. I can help you with information about this product's: - Description - Price - Quantity - Location - Contact details - Ratings - Media (images/videos) What would you like to know?
rw: Mugerageze kwandika neza icyo mucyeneye kumenya.Dore ibyo nabasha kugufasha kumenya kuri iki gicuruzwa: - Amakuru arambuye - Igiciro wakibonaho - Aho wagisanga - Amanota gifite k'isoko - Ifoto cyangwa videwo yacyo - Ndetse n'andimakuru yerecyeye nyiracyo. Mukeneye kumenya iki muri ibyo?

source: I'm sorry, I encountered an error while retrieving the product information. Please try again later.
rw: Mwutwihanganire duhuye n'akabazo dushakisha amakuru mwasabye, Mwongere mugerageze mukanya.

source: I can help you browse products, provide market insights, or answer questions about AgriConnect. What would you like to know?
rw: Mbafasha kubona ibicuruzwa, amakuru k'isoko ndetse no gusubiza ibibazo byerecyeye AgriConnect. Mucyeneye kumenya iki?

source: I'm sorry, I encountered an error. Please try again later.
rw: Mwihangana duhuye n'ikibazo. Mwongere mugerageze mukanya.

source: Name
rw: Izina

source: File size must be no more than 5MB.
rw: Ingano y'ifoto cyangwa videwo ntigomba kurenga 5MB.

source: Only JPG, PNG, and MP4 files are allowed.
rw: Hemewe JPG, PNG, na MP4 gusa.

source: Password must be at least 6 characters long.
rw: Ijambobanga ntirigomba kujya munsi y'inyuguti 6.

source: Password must contain at least one uppercase letter.
rw: Ijambobanga rigomba kugira byibuze inyuguti imwe nkuru.

source: Password must contain at least one lowercase letter.
rw: Ijambobanga rigomba kugira byibuze inyuguti imwe ntoya.

source: Password must contain at least one digit.
rw: Ijambobanga rigomba kugira byibuze umubare umwe.

source: Full Name
rw: Amazina yombi

source: Profile Picture
rw: Konti Yanjye

source: Bio
rw: Ibyerekeye nyiri konti

source: Province
rw: Intara

source: District
rw: Akarere

source: Sector
rw: Umurenge

source: Cell
rw: Akagari

source: Village
rw: Umudugudu

source: Specific Location
rw: Aho uherereye neza

source: Role
rw: Icyiciro

source: If you provide location, all location fields are required.
rw: Aho muherereye harakenewe, mwuhuzuze hose neza.

source: Selected district does not belong to the selected province.
rw: Akarere muhisemmo ntikabarizwa mu ntara mwahisemo.

source: Selected sector does not belong to the selected district.
rw: Umurenge muhisemmo ntubarizwa mu karere mwahisemmo.

source: Selected cell does not belong to the selected sector.
rw: Akagari muhisemo ntikaarizwa mu mu renge mwahisemo.

source: Selected village does not belong to the selected cell.
rw: Umudugudu muhisemmo ntuherereye mu kagari mwahisemo.

source: Login required to access this page.
rw: Mugomba kwinjira murinti kugirango mubashe kubona iyi paje.

source: Email not verified. Please check your email for the verification link.
rw: Imeyili ntiyemejwe. Nyamuneka reba ubutumwa bwo kwemeza muri imeyili yawe.

source: Invalid role selected for this account.
rw: Icyiciro cyahiswemo ntikiaho.

source: User profile not properly configured. Please contact support.
rw: Konti yawe ntirandikwa neza. Murebe ahatangirwa ubufasha.

source: Invalid username or password!
rw: Izina cyangwa ijambobanga ntabwo ari byo!

source: AgriConnect Email Verification
rw: Kwemeza Imeyili ya AgriConnect

source: Your verification code is: %(code)s
rw: Kode yo kwemeza ni: %(code)s

source: No email found for this session. Please try resending the verification code.
rw: Nta imeyili yabashije kuboneka. Nyamuneka gerageza kongera kohereza kode yo kwemeza.

source: No verification code found. Please request a new one.
rw: Nta kode yo kwemeza yaonetse. Mwongere musabe indi.

source: Email verified successfully! You can now log in.
rw: Kwemeza imeyili byakunze! Ubu mushobora kwinjira.

source: Verification code has expired. Please request a new one.
rw: Kode yo kwemeza yashaje. Musabe indi kode.

source: Invalid verification code. Please try again.
rw: Kode yo kwemeza siyo. Mwongere mugerageze.

source: Invalid verification process. Please try again.
rw: Uburyo bwo kwemeza ntabwo ari bwo. Mwongere mugerageze.

source: No email provided for verification.
rw: Nta imeyili yatanzwe yo kwemeza.

source: Your email is already verified.
rw: Imeyili yawe yarangije kwemezwa.

source: AgriConnect Email Verification - Resend
rw: Kwemeza Imeyili ya AgriConnect - Ongera wohereze

source: Your new verification code is: %(code)s
rw: Kode nshya yo kwemeza ni: %(code)s

source: A new verification code has been sent to your email.
rw: Kode nshya yo kwemeza yoherejwe kuri imeyili yawe.

source: Email not found.
rw: Imeyili ntabwo yabonetse.

source: You are not authorized to add a product.
rw: Nta burenganzira ufite bwo kwongeraho igicuruzwa.

source: Please update your profile with contact information before adding a product.
rw: Nyamuneka nimwongere nimero za telefoni kuri konti yanyu mubone kwongeraho igicuruzwa.

source: Product added successfully!
rw: Igicuruzwa Cyamazekwongerwaho neza!

source: An error occurred while saving the product. Please try again.
rw: Habayeho ikibazo tekinike mukubika igicuruzwa. Nyamuneka ongera ugerageze mukanya.

source: Please correct the errors in the form.
rw: Nyabuneka nimukosore amakosa mubyo mwanditse.

source: You are not authorized to edit this product.
rw: Nta burenganzira ufite bwo guhindura iki gicuruzwa.

source: Product updated successfully!
rw: Igicuruzwa cyahinduwe neza!

source: You are not authorized to delete this product.
rw: Nta burenganzira ufite bwo gusiba iki gicuruzwa.

source: Product deleted successfully!
rw: Igicuruzwa Cyamazekwongerwaho neza!

source: Please provide a valid rating between 1 and 5.
rw: Nyamuneka tanga amanota ari hagati ya 1 na 5.

source: Error updating location information. Please try again.
rw: Habayeho ikosa kuguhindura amakuru y'aho mutuye. Mwongere mugerageze.

source: Profile updated successfully.
rw: Igicuruzwa cyamaze guhindurwa neza!

source: Error loading location information. Please try again.
rw: Habayeho ikosa mugushaka amakuru y'aho muherereye. Mwongere mugerageze.

source: Login
rw: Injira

source: Email Address
rw: Imeyili

source: Password
rw: Ijambobanga

source: Select your role
rw: Hitamo icyiciro cyawe

source: Farmer
rw: Umuhinzi

source: Buyer
rw: Umuguzi

source: Cooperative
rw: Koperative

source: Don't have an account?
rw: Nta konti ufite?

source: Sign up now!
rw: Kora konti nonaha!

source: Add Your Produce
rw: Ongeraho umusaruro

source: If you don't provide a contact number, your profile's phone number will be used as the default contact for this product.
rw: Nudatanga nimero ya telefone, kuri ikigicuruzwa hazakoreshwa iyo usanganwe kuri konti yawe.

source: Add Product
rw: Ongeraho Igicuruzwa

source: Drag and drop your image here or click to browse
rw: Kurura ifoto ushyire hano cyangwa ukandeho uyishake

source: Supported formats: JPG, PNG, GIF (Max 5MB)
rw: Amaforume yemewe ni: JPG, PNG, GIF (zitarengeje ingano ya 5MB)

source: File size should not exceed 5MB
rw: Ubunini bw'ifoto cyangwa videwo ntibugomba kurenga ingano ya 5MB

source: Remove
rw: Kuraho

source: Home
rw: Ahabanza

source: Products
rw: Ibicuruzwa

source: Profile
rw: Konti Yanjye

source: Market Insights
rw: Amakuru k'Isoko

source: Logout
rw: Sohoka

source: Sign Up
rw: Iyandikishe

source: Connecting farmers to markets
rw: Guhuza abahinzi n'amasoko

source: Quick Links
rw: Inzira zihuse

source: Contact Us
rw: Tuvugishe

source: All rights reserved
rw: Uburenganzira bwose burafitwe

source: Delete Account
rw: Siba konti

source: Are you sure you want to delete your account? This action cannot be undone.
rw: Urashaka koko gusiba konti yawe? Iki gikorwa ntikizagarurwa.

source: Cancel
rw: Hagarika

source: Edit Product
rw: Hindura Igicuruzwa

source: Update your product information
rw: Hindura amakuru y'igicuruzwa cyawe

source: Current Media
rw: Isanzweho

source: Your browser does not support the video tag.
rw: Iyi videwo ntibashije kuboneka kubera ikibazo cya mudasobwa cyangwa telefone yanya

source: Drag and drop your new image here or click to browse
rw: Kurura ifoto nshyashya uyishyire hano cyangwa ukandeho uyishake

source: Save Changes
rw: Bika Impinduka

source: Edit Profile
rw: Hindura amakuru kuri konti

source: Basic Information
rw: Amakuru y'ibanze

source: Username
rw: Izina ukoresha

source: Phone Number
rw: Nimero ya telefone

source: Location Information
rw: Amakuru y'aho uherereye

source: Select Province
rw: Hitamo Intara

source: Select District
rw: Hitamo Akarere

source: Select Sector
rw: Hitamo Umurenge

source: Select Cell
rw: Hitamo Akagari

source: Select Village
rw: Hitamo Umudugudu

source: Welcome to AgriConnect
rw: Murakaza neza kuri AgriConnect

source: Connect, Trade, Grow
rw: Huza, Curuza, Agura

source: Rwanda's #1 digital marketplace for agriculture. Buy, sell, and discover fresh produce directly from local farmers and cooperatives.
rw: Iguriro ry'iyakure ryambere mu Rwanda ry'ibihingwa. Gura, Gurisha ndetse unamenye umusaruro ugifite umwimerere kuva kubahinzi ndetse n'ama koperative.

source: Get Started Free
rw: Tangira kubuntu

source: No fees. No hassle. 100%% local.
rw: Ntakiguzi. Ntakuvunika. Umwimerere 100%%

source: Why AgriConnect?
rw: Kuki AgriConnect?

source: Direct Connections
rw: Guhuza ku Buryo Butaziguye

source: No middlemen. Chat and trade directly with farmers, buyers, and cooperatives.
rw: NTABAMAMYI. Vugana n'abahinzi, abaguzi n'amakoperative Nyirizina.

source: See real-time prices, trends, and top products to make smart decisions.
rw: Reba ibiciro byanyabyo, ibigezweho ndetse ni ibicuruzwa ihiga ibindi ufate umwanzuro uboneye.

source: Easy & Secure
rw: Biroroshye kandi Birizewe

source: Simple to use, mobile-friendly, and safe for everyone.
rw: Ururubuga rworoshye gukoresha, rukorana neza n'amatelefone ndetse rwizewe kuri buri umwe.

source: Who Can Join?
rw: Abo rugenewe?

source: Farmers
rw: Abahinzi

source: List your harvest, reach more buyers, and get fair prices.
rw: Garagaza umusaruro wawe, ugere ku baguzi benshi, kandi ubone ibiciro ukwiye.

source: Join as Farmer
rw: Injira nk'Umuhinzi

source: Buyers
rw: Abaguzi

source: Find quality products, compare prices, and connect with trusted sellers.
rw: Bona ibicuruzwa bifite ubuziranenge, gereranya ibiciro kandi uhuze n'abacuruzi bizewe.

source: Join as Buyer
rw: Injira nk'Umuguzi

source: Cooperatives
rw: Koperative

source: Manage your group's products and connect with more customers.
rw: Cungira koperative yawe ibicuruzwa kandi uhuze n'abaguzi benshi.

source: Join as Cooperative
rw: Injira nka Koperative

source: Ready to Get Started?
rw: Witeguye Gutangira?

source: Sign up now and be part of Rwanda's growing agricultural community.
rw: Iyandikishe kuri AgriConnect uyu munsi ubundi ube umwe mubari k'isoko ry'ubuhinzi rikura ukwo bwije n'ukwo bucyeye mu Rwanda.

source: Create Your Account
rw: Kora Konti Yawe

source: Browse Products
rw: Reba Ibicuruzwa

source: My Profile
rw: Konti Yanjye

source: Welcome back,
rw: Murakaza neza,

source: Your Products
rw: Ibicuruzwa Byawe

source: Manage
rw: Cunga

source: Notifications
rw: Ubutumwa

source: View
rw: Reba

source: Settings
rw: Igenamiterere

source: Use the navigation above or shortcuts to explore AgriConnect.
rw: Koresha inzira zahafi ubona hejuru ubundi ukoreshe AgriConnect.

source: AgriConnect: Your Gateway to Rwanda's Agricultural Market
rw: AgriConnect: Inzira igana k'isoko ry'abahinzi bo mu Rwanda

source: Explore, connect, and grow your business with AgriConnect. Use the navigation or dashboard above to get started.
rw: Shakisha, uhuze ndetse wagure bizinesi yawe kuri AgriConnect. Tangira uyikoreshe uciye munzira zahafi ubona hejuru.

source: Discover real-time trends, top products, and leading farmers on AgriConnect. Make informed decisions with our up-to-date analytics and market data.
rw: Menya ibihe nyabyo, ibicuruzwa byo hejuru, hamwe nabahinzi bayoboye kuri AgriConnect. Fata ibyemezo byuzuye, isesengura rigezweho ndetse n'amakuru yisoko.

source: Total Products
rw: Byose hamwe

source: Active Farmers
rw: Abahinzi Bari Kurubuga

source: Average Rating
rw: Impuzandengo y'amanota

source: Top Rated Products
rw: Ibicuruzwa Byahize ibindi mu manota

source: %(product.num_ratings)s ratings
rw: %(product.num_ratings)s Amanota

source: No product ratings yet.
rw: Ntamanota aratangwa kugicuruzwa.

source: Top Performing Farmers
rw: Abahinzi Bahize Abandi

source: Average Rating Across All Products
rw: Impuzandengo y'amanota kubicuruzwa byose.

source: %(farmer.total_products)s products
rw: Ibicuruzwa %(farmer.total_products)s

source: No farmer ratings yet.
rw: Ntamanota aratangwa.

source: Market Trends
rw: Ibigezweho k'isoko

source: 6 Months
rw: Amezi 6

source: 1 Year
rw: Umwaka 1

source: Track how product listings and ratings have changed over time.
rw: Reba ukwo ibicuruzwa byagiye bishyirwaho n'amanota byagiye bihindagurika.

source: Product Listings
rw: Ibicuruzwa

source: Average Ratings
rw: Impuzandengo y'amanota

source: Not Provided
rw: Ntabyatanzwe

source: Added
rw: Byashyizweho

source: Browse all available agricultural products. Use filters to find exactly what you need from Rwanda's farmers and cooperatives.
rw: Reba ibicuruzwa byose biboneka mubuhinzi. Yungurura kugirango umenye neza ibyo ukeneye mubahinzi ndetse no mu makoperative yo Rwanda.

source: Filters
rw: Yungurura

source: Search products...
rw: Shakisha ibicuruzwa...

source: Apply Filters
rw: Yungurura

source: Clear Filters
rw: Siba

source: Submit Rating
rw: Ohereza Amanota

source: ratings
rw: Amanota

source: Talk to us
rw: Tuganirize

source: No products found
rw: Nta bicuruzwa byabonetse

source: Try adjusting your filters or search criteria
rw: Gerageza guhindura uburyo bwo gushakisha

source: Create Account
rw: Kora Konti

source: Confirm Password
rw: Emeza Ijambobanga

source: Already have an account?
rw: Usanzwe ufite konti?

source: Login here!
rw: Injirira hano

source: This field is required
rw: Aha hagomba kuzuzwa

source: Creating Account...
rw: Ikorwa rya konti...

source: Passwords do not match
rw: Ijambobanga ntabwo rihuye

source: At least 6 characters
rw: Byibuze inyuguti 6

source: At least one uppercase letter
rw: Byibuze Inyukuti nkuru imwe

source: At least one lowercase letter
rw: Byibuze inyuguti ntoya imwe

source: At least one digit
rw: Byibuze umubare umwe

source: Weak
rw: Iroroshye

source: Strong
rw: Irakomeye

source: Medium
rw: Iri murugero

source: Failed to load provinces. Please try again.
rw: Intara mwahisemo siyo. Mwongere mugerageze.

source: Failed to load districts. Please try again.
rw: Akarere mwahisemo siko. Mwongere mugerageze.

source: Failed to load sectors. Please try again.
rw: Umurenge mwahisemo siwo. Mwongere mugerageze.

source: Failed to load cells. Please try again.
rw: Akagari mwahisemo siko. Mwongere mugerageze.

source: Failed to load villages. Please try again.
rw: Umudugudu mwahisemo siwo. Mwongere mugerageze.

source: Your Rating:
rw: Amanota yawe

source: ago
rw: Ashize/Ishize

source: View Product
rw: Reba Igicuruzwa

source: The products you rated will appear here.
rw: Ibicuruzwa mwakunze mugaha amanota bizajya bigaragara aha.

source: You haven't added any products yet!
rw: Nta bicuruzwa wariwashyiraho!

source: Edit
rw: Hindura

source: Delete
rw: Siba

source: You are registered as a buyer. Browse products and rate them!
rw: Wiyandikishije nk'Umuguzi. Reba ibicuruzwa ibyo ukunda ubihe amanota!

source: Verify Your Email
rw: Subiramo imeyili yawe

source: Please enter the 6-digit verification code sent to your email address.
rw: Kode nshya yo kwemeza yoherejwe kuri imeyili yawe.

source: Verify Email
rw: Suiramo Imeyili

source: Didn't receive the code?
rw: Nta kode mwakiriye?

source: Resend Code
rw: Ongera wohereze
